/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   insert_piece.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mmonahan <mmonahan@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/19 17:56:44 by mmonahan          #+#    #+#             */
/*   Updated: 2019/09/19 18:06:44 by mmonahan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "filler.h"


/*
**	сранивать все *:
 * 					-1 должен быть один раз!
 * 					-2 ни одного раза!
 * 		тогда:	считаем сумму цыфр где есть *
 * 		иначе:	идем дальше
*/
void insert_piece(t_plateau plateau, t_piece piece, t_player player)
{

	write(1, "8 1\n", 4);
}